tap "homebrew/bundle"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "lihaoyun6/tap"
tap "mongodb/brew"
tap "stripe/stripe-cli"
tap "stripe/stripe-mock"
tap "teamookla/speedtest"
brew "python@3.12"
brew "awscli"
brew "bash"
brew "bat"
brew "bear"
brew "bottom"
brew "cmake"
brew "coreutils"
brew "ffmpeg"
brew "gh"
brew "gifsicle"
brew "git"
brew "gnupg"
brew "go"
brew "grep"
brew "hdf5"
brew "httpie"
brew "libomp"
brew "imagemagick"
brew "jpegoptim"
brew "jq"
brew "lazygit"
brew "luarocks"
brew "mackup"
brew "mas"
brew "neovim"
brew "nvm"
brew "open-mpi"
brew "optipng"
brew "pandoc"
brew "pdftk-java"
brew "pipx"
brew "pngquant"
brew "poppler"
brew "pyenv"
brew "qt"
brew "redis"
brew "ripgrep"
brew "smartmontools"
brew "subversion"
brew "svgo"
brew "telnet"
brew "tldr"
brew "trash"
brew "tree"
brew "typst"
brew "vcpkg"
brew "wget"
brew "yarn"
brew "stripe/stripe-cli/stripe"
brew "stripe/stripe-mock/stripe-mock"
brew "teamookla/speedtest/speedtest"
cask "1password"
cask "android-platform-tools"
cask "applite"
cask "caffeine"
cask "chatgpt"
cask "clion"
cask "codeedit"
cask "discord"
cask "downie"
cask "drawio"
cask "eudic"
cask "figma"
cask "firefox"
cask "github"
cask "google-chrome"
cask "helo"
cask "herd"
cask "httpie"
cask "iina"
cask "imageoptim"
cask "jupyter-notebook-viewer"
cask "maccy"
cask "mactex"
cask "microsoft-teams"
cask "mos"
cask "navicat-premium"
cask "netron"
cask "obs"
cask "orbstack"
cask "paraview"
cask "pastebot"
cask "picgo"
cask "postman"
cask "proxyman"
cask "qt-creator"
cask "quickrecorder"
cask "readdle-spark"
cask "screenflow"
cask "slack"
cask "spotify"
cask "steam"
cask "swiftformat-for-xcode"
cask "tableplus"
cask "telegram-desktop"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vmware-fusion"
cask "warp"
cask "wezterm"
cask "whatsapp"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "davidbwaters.macos-modern-theme"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-extension-pack"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "james-yu.latex-workshop"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "myriad-dreamin.tinymist"
vscode "nvarner.typst-lsp"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "torn4dom4n.latex-support"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vue.volar"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
